[
  {
    "company": "Totvs | Brazil (Remote)",
    "description": "I worked as a contractor for Outsera as a Front-End Developer on the TOTVS Fluig Portals team, being responsible for the development and maintenance of the system, with a focus on continuously improving the interface and user experience. Implemented new features based on prototypes, fixed bugs, suggested platform improvements, and maintained the company's Design System to improve user experience and system reliability. Applied Clean Code practices, did code reviews, and worked in agile environments using Scrum and Kanban to ensure good code quality and effective teamwork. Used technologies like HTML, CSS, LESS, Sass, JavaScript, Custom Elements, MustacheJS, jQuery, REST API, Git, and Azure DevOps to build strong front-end solutions, increasing system performance and scalability.",
    "location": "Joinville, Brazil · Remote",
    "period": "Jun/2024 - Jul/2025",
    "position": "SENIOR FRONT-END ENGINEER"
  },
  {
    "company": "Kenect | United States (Remote)",
    "description": "Played a key role in developing a user-friendly platform at Kenect, helping backend teams integrate with partner systems. Used the Kenect Design System to design and build the platform, working closely with managers and backend teams to define efficient endpoints. Helped improve and maintain features in the main Kenect application. Worked with other front-end developers, designers, and a product manager to deliver useful tools and updates. Led front-end development for a platform that connected with partner systems via APIs, improving scalability and user experience. Built responsive interfaces using React, Redux-Saga, and Firebase, following the company’s design system. Worked with backend, product, and design teams to launch new features in agile cycles (Scrum). Debugged, tested, and optimized important features used by thousands of users.",
    "location": "Salt Lake City, Utah, United States (remote)",
    "period": "Oct/2021 - Jan/2024",
    "position": "FRONT-END SOFTWARE ENGINEER"
  },
  {
    "company": "VEXPRO Business IT | Brazil (Remote)",
    "description": "I helped develop a complete finance system for an agribusiness cooperative using React and Redux. I created reusable components to support scalability and efficiency. Built corporate portals and systems for both SharePoint Classic and Modern sites, delivering customized solutions to meet clients’ needs. Developed custom modules and components to improve functionality and user experience. Customized Material-UI themes to match designer instructions, aligning with corporate branding and improving visual consistency. Built a solid service desk platform similar to Jira, allowing issue tracking, feature requests, and project management. I used AngularJS, Bootstrap, and SharePoint for the front-end, back-end, and layout, adding workflows for automatic email alerts. Contributed to creating custom modules and components in SharePoint Portals, improving the overall platform experience. Worked with a SharePoint expert to create an Enterprise Content Management (ECM) system using SPFx and React with TypeScript, securely managing over 1 million digital documents with detailed permission settings.",
    "location": "Curitiba Area, Brazil · On-site",
    "period": "Sep/2016 - Oct/2021",
    "position": "SHAREPOINT/FRONT-END ENGINEER"
  },
  {
    "company": "PRx Consultoria em Seguros | Brazil (Remote)",
    "description": "Led the development of a custom partner platform that allowed PRx affiliates to read announcements, follow goals, and see dashboards for their region. Developed the front-end using React, Redux-Thunk, and Material-UI to build a responsive, user-friendly interface, improving partner engagement and reducing support needs. Built a scalable backend with NestJS and Node.js, and connected it with MySQL for secure and efficient data storage. Created and integrated REST APIs with JWT authentication to ensure secure access and precise control of data. Gave admins the ability to manage users and content, helping to improve internal processes and save time on manual updates.",
    "location": "Curitiba, Paraná, Brazil · Remote",
    "period": "Mar/2020 - Sep/2020",
    "position": "FULLSTACK ENGINEER"
  },
  {
    "company": "Nova Info Juris | Brazil (Remote)",
    "description": "Designed strong recursive logic to collect paginated data from a public legal endpoint, managing large amounts of data with retries and error control to ensure completeness and accuracy. Used intelligent filtering to find and extract publications related to specific lawyers by applying a normalized full-text search, improving relevance and search efficiency. Scheduled automatic data collection with node-cron, set to run at certain times with timezone support, making updates accurate and on time. Parsed, formatted, and split data into structured .txt files, creating general court files and lawyer-specific ones, saving them in dynamic folders to keep data organized. Wrote custom parsers to format, group, and save content into .txt files sorted by court and lawyer, using a dynamic folder structure for easy access and archiving. Optimized the process with data streaming, batching, and delay-based retries to protect the system and the API, improving performance and reliability. Impact: Cut processing time by more than 80%, removed the need for manual monitoring, and let the legal team focus on client cases instead of sorting documents.",
    "location": "Curitiba, Paraná, Brazil",
    "period": "Apr/2020 - Sep/2020",
    "position": "JAVASCRIPT DEVELOPER"
  },
  {
    "company": "Moments.Surf | Brazil (Remote)",
    "description": "Originally hired to support the web platform using AngularJS 1.0, Bootstrap, and Git, I improved interface responsiveness, fixed bugs, and refactored legacy components. Soon after, I transitioned to the mobile team, working on the hybrid app built with Ionic/Cordova. Added new features and performed maintenance on the mobile app, integrating with Parse Server, optimizing Node.js APIs, and adjusting data handling with MongoDB. Supported infrastructure setup on AWS for production deployment and app store release. Played a key role in stabilizing the app and resolving pre-launch issues. Outcome: Helped deliver a stable and functional app on time, contributing to a smooth and successful launch.",
    "location": "Curitiba, Paraná, Brazil",
    "period": "Oct/2016 - Dec/2016",
    "position": "MOBILE DEVELOPER"
  },
  {
    "company": "Big Brain | Brazil (Remote)",
    "description": "Designed and developed a student management platform, enabling administrators to manage students, classes, and teachers efficiently. Created responsive web portals using JavaScript, jQuery, and Bootstrap, ensuring seamless performance across devices and browsers. Built a custom C# Web API to integrate SharePoint with databases, automating data updates and improving data consistency. Enhanced overall UX by collaborating closely with stakeholders to refine requirements and deliver intuitive user interfaces. Impact: Successfully delivered a robust system that optimized school operations and significantly reduced manual data processing.",
    "location": "Curitiba, Paraná, Brazil",
    "period": "Apr/2016 - Aug/2016",
    "position": "FRONT-END DEVELOPER"
  },
  {
    "company": "Positivo Informática | Brazil (Remote)",
    "description": "Developed educational projects using C#, .NET, Angular, and SQL Server. Worked on the development of educational activities and games using HTML5.",
    "location": "Curitiba, Paraná, Brazil",
    "period": "Aug/2015 - Feb/2016",
    "position": "FULLSTACK (.NET, ANGULAR.JS)"
  },
  {
    "company": "Positivo Informática | Brazil (Remote)",
    "description": "Developed interactive educational content with HTML5 to be used in Positivos school by their students.",
    "location": "Curitiba, Paraná, Brazil",
    "period": "Dec/2012 - Aug/2015",
    "position": "FRONTEND DEVELOPER"
  }
]